/*
 * frame_conf_total.c
 *
 *  Created on: 2017年9月25日
 *      Author: root
 */

#include "includes.h"
#include "can_standard.h"

can_frame_t can_frame_ar[] =
{
/********** pf_0X61 ***********/
{.out = "AMTTCU", .in = "EVCU", .id = 0X0C61D0D1, .p = 3, .pf = 0X61, .ps = 0XD0, .sa = 0XD1, .cycle_time_in_ms = 20,
		.total_node = 8, .can_node_ar =
		{
		{"DM_state", "电机实际状态", 0, 2, 1, 0,
		{"未使能", "驱动", "制动"}, 3},
		{"DM_Orient", "电机实际转向", 2, 2, 1, 0,
		{"停止", "前进", "倒车"}, 3},
		{"DM_Control_Mode", "电机当前控制模式", 4, 2, 1, 0,
		{"自由转模式", "转矩控制模式", "转速控制模式"}, 3},
		// 2 bit null   				{"", "", ""}
				{"DM_Trq_Actual", "电机实际扭矩", 8, 16, 1, 3000},
				{"DM_Spd_Actual", "电机实际转速", 24, 16, 1, 15000},
				{"DM_Torque_Max", "最大扭矩能力", 40, 16, 1, 3000},
				{"DM_Fault_Level", "电机故障等级", 56, 2, 1, 0,
				{"无故障", "一级故障请求电机关断", "二级故障请求降功率", "三级故障一般故障"}, 4},
				{"DM_Fault_Code", "电机故障码", 58, 5, 1, 0,
				{"正常", "母线电流过流", "电压超极限", "逆变器温度高于极限值", "绕组温度高于极限值", "IGBT模块故障", "通讯故障", "传感器故障", "电池电压较低", "电机转速较高",
						"电机温度高", "驱动电压较低", "发电电压较高", "逆变器温度高", "绕组温度高", "绕组短路", "电机绝缘故障", "电机控制器绝缘故障", "电机绕组阻值异常",
						"电机三相线接线错误", "电机控制器直流母线接线错误", "电机控制器低压电源电压过高", "电机控制器低压电源电压高超极限", "电机控制器低压电源电压过低",
						"电机控制器低压电源电压低超极限", "电机转速超极限", "电机绕组电流过大超极限", "电机绕组电流较大", "备用"}, 28
				// 1 bit null
				}}},

/********** pf_0X62 ***********/
{.out = "AMTTCU", .in = "EVCU", .id = 0X0C62D0D1, .p = 3, .pf = 0X62, .ps = 0XD0, .sa = 0XD1, .cycle_time_in_ms = 20,
		.total_node = 6, .can_node_ar =
		{
		{"DM_Tmp_Mtr", "电机绕组温度", 0, 8, 1, 40},
		{"DM_Tmp_Inv", "电机逆变器温度", 8, 8, 1, 40},
		{"DM_Voltage_C", "电机实际电压", 16, 16, 1, 0},
		{"DM_I_Actual", "电机实际电流", 32, 16, 1, 500},
		{"null", "保留", 48, 8, 1, 0},
		{"life", "生命信号", 56, 8, 1, 0}}},

/********** pf_0X63 ***********/
{.out = "AMTTCU", .in = "EVCU", .id = 0X0C63D0D1, .p = 3, .pf = 0X63, .ps = 0XD0, .sa = 0XD1, .cycle_time_in_ms = 20,
		.total_node = 31, .can_node_ar =
		{
		{"DG_Gear_Using", "变速箱档位", 0, 4, 1, 0},
		{"DG_Gear_Target", "变速箱目标档位", 4, 4, 1, 0},
		{"DG_Vehcile_Speed", "车速", 8, 16, 0.1, 0},

		{"FG_Na", "空挡", 24, 1, 1, 0},
		{"FG_R", "R档", 25, 1, 1, 0},
		{"FG_D", "D档", 26, 1, 1, 0},
		{"FG_M", "M档", 27, 1, 1, 0},
		// 4 bit null
				{"err_code1", "主控车速状态", 32, 1, 1, 0,
				{"正常", "故障"}, 2},
				{"err_code2", "主控1,2档传感器搭铁状态", 33, 1, 1, 0,
				{"正常", "故障"}, 2},
				{"err_code3", "主控1,2档传感器开路状态", 34, 1, 1, 0,
				{"正常", "故障"}, 2},
				{"err_code4", "主控3,4档传感器搭铁状态", 35, 1, 1, 0,
				{"正常", "故障"}, 2},
				{"err_code5", "主控3,4档传感器开路状态", 36, 1, 1, 0,
				{"正常", "故障"}, 2},
				{"err_code6", "主控挂1,2档状态", 37, 1, 1, 0,
				{"正常", "  故障"}, 2},
				{"err_code7", "主控挂3,4档状态", 38, 1, 1, 0,
				{"正常", "  故障"}, 2},

				{"err_code8", "主控1档状态", 39, 1, 1, 0,
				{"正常", "故障"}, 2},
				{"err_code9", "主控2档状态", 40, 1, 1, 0,
				{"正常", "故障"}, 2},
				{"err_code10", "主控3档状态", 41, 1, 1, 0,
				{"正常", "故障"}, 2},
				{"err_code11", "主控4档状态", 42, 1, 1, 0,
				{"正常", "故障"}, 2},

				{"err_code12", "主控MCU CAN状态", 43, 1, 1, 0,
				{"正常", "故障"}, 2},
				{"err_code13", "主控第一单元电机状态", 44, 1, 1, 0,
				{"正常", "故障"}, 2},
				{"err_code14", "主控第二单元电机状态", 45, 1, 1, 0,
				{"正常", "故障"}, 2},
				{"err_code15", "主控第三单元电机状态", 46, 1, 1, 0,
				{"正常", "故障"}, 2},
				{"err_code16", "主控第四单元电机状态", 47, 1, 1, 0,
				{"正常", "故障"}, 2},

				{"err_code17", "主控VCU can状态", 48, 1, 1, 0,
				{"正常", "故障"}, 2},
				{"err_code18", "主控主控单元CAN状态", 49, 1, 1, 0,
				{"正常", "故障"}, 2},
				{"err_code19", "主控分配工作ID状态", 50, 1, 1, 0,
				{"正常", "故障"}, 2},
				{"err_code20", "主控自学习状态", 51, 1, 1, 0,
				{"正常", "故障"}, 2},

				{"err_code21", "主控操纵杆信号1开路状态", 52, 1, 1, 0,
				{"正常", "故障"}, 2},
				{"err_code22", "主控操纵杆信号1搭铁状态", 53, 1, 1, 0,
				{"正常", "故障"}, 2},
				{"err_code23", "主控操纵杆信号2开路状态", 54, 1, 1, 0,
				{"正常", "故障"}, 2},
				{"err_code24", "主控操纵杆信号3搭铁状态", 55, 1, 1, 0,
				{"正常", "故障"}, 2},

		// 8 bit null
				}},

/**************************************************************************************************************/
/**************************************************************************************************************/
/**************************************************************************************************************/
/**************************************************************************************************************/
/**************************************************************************************************************/
/**************************************************************************************************************/

/********** pf_25 ***********/
{.out = "EVCU", .in = "DMCM", .id = 0X0C19A7F0, .p = 3, .pf = 25, .ps = 240, .sa = 167, .cycle_time_in_ms = 20,
		.total_node = 12, .can_node_ar =
		{
		{"cmd_DM_target_torgue", "命令_DM目标转矩", 0, 16, 1, 32000},
		{"cmd_DMC_U_limit", "命令_DM限制电压", 16, 16, 0.1, 10000},		// voltage
				{"cmd_DMC_I_limit", "命令_DM限制电流", 32, 16, 0.1, 10000},
				{"cmd_DM_stop", "命令_DM停机", 48, 1, 1, 0},
				{"cmd_DM_drive", "命令_DM驱动", 49, 1, 1, 0},
				{"cmd_DM_brake", "命令_DM制动", 50, 1, 1, 0},
				{"cmd_DM_backword", "命令_DM向后", 51, 1, 1, 0},
				{"cmd_DM_forward", "命令_DM向前", 52, 1, 1, 0},
				{"cmd_DM_mode", "命令_DM转矩或转速", 53, 1, 1, 0},
				{"null_bit", "命令_DM保留", 54, 1, 1, 0},
				{"command_DM_ready", "命令_DM_ready", 55, 1, 1, 0},
				{"EVCU_life", "EVCU_life", 56, 8, 1, 0}}},

/********** pf_8 ***********/
{.out = "DMCM", .in = "EVCU", .id = 0X0C08A7F0, .p = 3, .pf = 8, .ps = 167, .sa = 240, .cycle_time_in_ms = 20,
		.total_node = 12, .can_node_ar =
		{
		{"DM_torgue", "DM状态_转矩", 0, 16, 1, 32000},
		{"DM_speed", "DM状态_转速", 16, 16, 0.5, 0},
		{"DM_in_I", "DMCM状态_电流", 32, 16, 0.1, 10000},
		{"DM_stop", "DM状态_停机", 48, 1, 1, 0},
		{"DM_drive", "DM状态_驱动", 49, 1, 1, 0},
		{"DM_brake", "DM状态_制动", 50, 1, 1, 0},
		{"DM_backword", "DM状态_向后 ", 51, 1, 1, 0},
		{"DM_forward", "DM状态_向前", 52, 1, 1, 0},
		{"DM_mode", "DM状态_转矩或转速", 53, 1, 1, 0},
		{"DMCM_error", "DM状态_故障", 54, 1, 1, 0},
		{"DM_ready", "DM状态_ready", 55, 1, 1, 0},
		{"DM_life", "DM_life", 56, 8, 1, 0}}},

/********** pf_9 ***********/
{.out = "DMCM", .in = "EVCU", .id = 0X0C09A7F0, .p = 3, .pf = 9, .ps = 167, .sa = 240, .cycle_time_in_ms = 10,
		.total_node = 8, .can_node_ar =
		{
		{"DM_rectified_U", "DM状态_整流电压", 0, 16, 0.1, 10000},
		{"DM_rectified_I", "DM状态_整流电流", 16, 16, 0.1, 10000},
		{"DM_temperature", "DM状态_DM温度", 32, 8, 1, 40},
		{"DMCM_temperature", "DM状态_DMCM温度", 40, 8, 1, 40},
		{"DM_main_contactor", "DM状态_主接触器", 48, 1, 1, 0},
		{"DM_charge_contactor", "DM状态_充电接触器", 49, 1, 1, 0},
		{"null_bit", "DM状态_保留", 50, 6, 1, 0},
		{"DM_error_code", "DM状态_故障代码", 56, 8, 1, 0}}},

///********** pf_255 ***********/
//{
//
//},

		/********** pf_1 ***********/
		{.out = "EVCU", .in = "ONC", .id = 0X0C01A2A7, .p = 3, .pf = 1, .ps = 162, .sa = 167, .cycle_time_in_ms = 20,
				.total_node = 15, .can_node_ar =
				{
				{"drive_pedal", "牵引踏板信号", 0, 8, 0.4, 0},
				{"brake_pedal", "制动踏板信号", 8, 8, 0.4, 0},
				{"stall_forward", "档位信号_向前", 16, 1, 1, 0},
				{"stall_backward", "档位信号_向后", 17, 1, 1, 0},
				{"stall_empty", "档位信号_空档", 18, 1, 1, 0},
				{"stall_still_what1", "档位信号_驻车", 19, 1, 1, 0},	// ...
						{"stall_what2", "档位信号_接地", 20, 1, 1, 0},	// ...
						{"stall_what3", "档位信号_紧急", 21, 1, 1, 0},
						{"clutch_status", "离合器状态", 22, 2, 1, 0},
						{"stall_now", "当前档位", 24, 8, 1, 0},
						{"clutch_pedal", "离合器踏板信号", 32, 8, 1, 0},
						{"EVCU_error_code", "EVCU故障代码", 40, 8, 1, 0},
						{"EVCU_life", "EVCU_life", 48, 8, 1, 0},
						{"bus_type", "车辆类型", 56, 4, 1, 0},
						{"battery_type", "储能系统类型", 60, 4, 1, 0}}},

		/********** pf_4 ***********/
		{.out = "EVCU", .in = "ONC", .id = 0X0C04A2A7, .p = 3, .pf = 4, .ps = 162, .sa = 167, .cycle_time_in_ms = 20,
				.total_node = 8, .can_node_ar =
				{
				{"single_battery_max_U", "储能单体最高电压", 0, 12, 0.01, 0},
				{"battery_index_max_U", "储能单体最高电压电池箱号", 12, 4, 1, 0},
				{"single_battery_min_U", "储能单体最低电压", 16, 12, 0.01, 0},
				{"battery_index_min_U", "储能单体最低电压电池箱号", 28, 4, 1, 0},
				{"battery_module_max_temperature", "储能模块最高温度", 32, 8, 1, 40},
				{"battery_module_average_temperature", "储能模块平均温度", 40, 8, 1, 40},
				{"battery_module_SOC", "储能系统SOC", 48, 8, 0.4, 0},
				{"battery_module_status", "储能系统状态", 56, 8, 1, 0}}},

		/********** pf_5 ***********/
		{.out = "EVCU", .in = "ONC", .id = 0X0C05A2A7, .p = 3, .pf = 5, .ps = 162, .sa = 167, .cycle_time_in_ms = 20,
				.total_node = 12, .can_node_ar =
				{
				{"cmd_DM_target_torgue", "命令_DM目标转矩", 0, 16, 1, 32000},
				{"cmd_DMC_U_limit", "命令_DM限制电压", 16, 16, 0.1, 10000},		// voltage
						{"cmd_DMC_I_limit", "命令_DM限制电流", 32, 16, 0.1, 10000},
						{"cmd_DM_stop", "命令_DM停机", 48, 1, 1, 0},
						{"cmd_DM_drive", "命令_DM驱动", 49, 1, 1, 0},
						{"cmd_DM_brake", "命令_DM制动", 50, 1, 1, 0},
						{"cmd_DM_backword", "命令_DM向后", 51, 1, 1, 0},
						{"cmd_DM_forward", "命令_DM向前", 52, 1, 1, 0},
						{"cmd_DM_mode", "命令_DM转矩或转速", 53, 1, 1, 0},
						{"null_bit", "命令_DM保留", 54, 1, 1, 0},
						{"command_DM_ready", "命令_DM_ready", 55, 1, 1, 0},
						{"EVCU_life", "EVCU_life", 56, 8, 1, 0}}},

		/********** pf_6 ***********/
		{.out = "EVCU", .in = "ONC", .id = 0X0C06A2A7, .p = 3, .pf = 6, .ps = 162, .sa = 167, .cycle_time_in_ms = 20,
				.total_node = 12, .can_node_ar =
				{
				{"DM_torgue", "DM状态_转矩", 0, 16, 1, 32000},
				{"DM_speed", "DM状态_转速", 16, 16, 0.5, 0},
				{"DM_in_I", "DMCM电流", 32, 16, 0.1, 10000},
				{"DM_stop", "DM状态_停机", 48, 1, 1, 0},
				{"DM_drive", "DM状态_驱动", 49, 1, 1, 0},
				{"DM_brake", "DM状态_制动", 50, 1, 1, 0},
				{"DM_backword", "DM状态_向后 ", 51, 1, 1, 0},
				{"DM_forward", "DM状态_向前", 52, 1, 1, 0},
				{"DM_mode", "DM状态_转矩或转速", 53, 1, 1, 0},
				{"DMCM_error", "DM状态_故障", 54, 1, 1, 0},
				{"DM_ready", "DM状态_ready", 55, 1, 1, 0},
				{"DM_life", "DM_life", 56, 8, 1, 0}}},

		/********** pf_7 ***********/
		{.out = "EVCU", .in = "ONC", .id = 0X0C07A2A7, .p = 3, .pf = 7, .ps = 162, .sa = 167, .cycle_time_in_ms = 20,
				.total_node = 6, .can_node_ar =
				{
				{"DMCM_contactor_U1", "DMCM接触器前端电压", 0, 16, 0.1, 10000},
				{"DM_temperature", "DM温度", 16, 8, 1, 40},
				{"DMCM_temperature", "DMCM温度", 24, 8, 1, 40},
				{"DMCM_contactor_U2", "DMCM接触器后端电压", 32, 16, 0.1, 10000},
				{"DMCM_contactor_status", "DMCM接触器状态", 48, 8, 1, 0},
				{"DM_error_code", "DM故障代码", 56, 8, 1, 0}	// ..................................
				}}

};

int can_frame_ar_length = sizeof(can_frame_ar) / sizeof(can_frame_ar[0]);

